2021-03-09-welcome-stranger.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://c3lphie.com/rss.xml"
      title="RSS feed for https://c3lphie.com">
<title>Welcome Stranger</title>
<meta name="author" content="John Dow">
  <meta name="referrer" content="no-referrer">
  <link href= "static/style.css" rel="stylesheet" type="text/css" />
  <link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://c3lphie.com">My Static Org Blog</a>
  </div></div>
<div id="content">
<div class="post-date">09 Mar 2021</div><h1 class="post-title"><a href="https://c3lphie.com/2021-03-09-welcome-stranger.html">Welcome Stranger</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9411016">1. A short introduction</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9411016" class="outline-2">
<h2 id="org9411016"><span class="section-number-2">1</span> A short introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
First of all welcome.
You're probably stumbling upon my humble little island, as one might call it, in the vast ocean called the internet!
Now before you go all grammar nazi on my english punctuation, let it be known that it is my second language.
And I therefore won't proof read these posts too much, because I don't wanna stress about it even more than I do in the first place.
(ofc I'll correct the obvious ones of course)
</p>

<p>
Enough about that, this is an introduction to my blog, and not my fear of being judged on my writing.
So what should you expect to see here?
Well as I'm a huge sucker for cyber security, more specifically hacking into stuff and breaking things (with permission ofc!).
Most of my content will probably be write-ups from <a href="https://www.hackthebox.eu">HackTheBox</a>, <a href="https://www.tryhackme.com">TryHackMe</a> or ctf-competitions that I play in.
(For those who don't know what a ctf is <a href="https://ctftime.org/ctf-wtf/">Click Here</a>)
</p>

<p>
Other things you might encounter here would be small neat tricks or things to do with the terminal, or just generally on linux.
Maybe if I feel like it I might post about cooking.
I don't want to feel like I can't post certain things just because I decided this was security only.
This I my blog, where I post about what I want, when I want.
</p>

<p>
So sit back, relax, grab a hot cup of coffee and join me on this weird adventure I have started.
</p>
</div>
</div>
<div class="taglist"><a href="https://c3lphie.com/tags.html">Tags</a>: <a href="https://c3lphie.com/tag-blog.html">blog</a> </div></div>
<div id="postamble" class="status"><div id="archive">
  <a href="https://c3lphie.com/archive.html">Other posts</a>
  </div></div>
</body>
</html>
